specters312/SVD_DUMP/Atmel/ATSAM4LC2A.svd
        <register>
          <name>VERSION</name>
          <description>Version Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000311</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WER</name>
          <description>Wake Enable Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OVFSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The corresponing event will not wake up the CPU from sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The corresponding event will wake up the CPU from sleep mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALARM0</name>
              <description>Alarm 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ALARM0Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The corresponing event will not wake up the CPU from sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The corresponding event will wake up the CPU from sleep mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALARM1</name>
              <description>Alarm 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ALARM1Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The corresponing event will not wake up the CPU from sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The corresponding event will wake up the CPU from sleep mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER0</name>
              <description>Periodic 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PER0Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The corresponing event will not wake up the CPU from sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The corresponding event will wake up the CPU from sleep mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER1</name>
              <description>Periodic 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PER1Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The corresponing event will not wake up the CPU from sleep mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The corresponding event will wake up the CPU from sleep mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BPM</name>
      <version>1.2.0</version>
      <description>Backup Power Manager</description>
      <groupName>BPM</groupName>
      <prependToName>BPM_</prependToName>
      <baseAddress>0x400F0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BPM</name>
        <value>37</value>
      </interrupt>
      <registers>
        <register>
          <name>BKUPPMUX</name>
          <description>Backup Pin Muxing Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BKUPPMUX</name>
              <description>Backup Pin Muxing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKUPWCAUSE</name>
          <description>Backup Wake up Cause Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>BKUPWEN</name>
          <description>Backup Wake up Enable Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>BPR</name>
          <description>Bypass Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RUNPSPB</name>
              <description>Run Mode Power Scaling Preset Bypass</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSMPSPB</name>
              <description>Power Save Mode Power Scaling Preset Bypass</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEQSTN</name>
              <description>Sequencial Startup from ULP (Active Low)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSBTD</name>
              <description>Power Scaling Bias Timing Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSHFD</name>
              <description>Power Scaling Halt Flash Until VREGOK Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLYRSTD</name>
              <description>Delaying Reset Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIASSEN</name>
              <description>Bias Switch Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LATSEN</name>
              <description>Latdel Switch Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD18CONT</name>
              <description>BOD18 in continuous mode not disabled in WAIT/RET/BACKUP modes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POBS</name>
              <description>Pico Uart Observability</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FFFW</name>
              <description>Force Flash Fast Wakeup</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBRDYEN</name>
              <description>Flash Bias Ready Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVREFSEN</name>
              <description>Flash Vref Switch Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPSAVEPS</name>
          <description>Factory Word Power Save PS Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WREGLEVEL</name>
              <description>Wait mode Regulator Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WBIAS</name>
              <description>Bias in wait mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WLATDEL</name>
              <description>Flash Latdel in wait mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RREGLEVEL</name>
              <description>Retention mode Regulator Level</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RBIAS</name>
              <description>Bias in Retention mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RLATDEL</name>
              <description>Flash Latdel in Retention mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BREGLEVEL</name>
              <description>Backup mode Regulator Level</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POR18DIS</name>
              <description>POR 18 Disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FWSAS</name>
              <description>Flash Wait State Automatic Switching</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FWRUNPS</name>
          <description>Factory Word Run PS Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>REGLEVEL</name>
              <description>Regulator Voltage Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REGTYPE</name>
              <description>Regulator Type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>REGTYPESelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XULP</name>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFTYPE</name>
              <description>Reference Type</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>REFTYPESelect</name>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BG</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPBG</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNAL</name>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHLATDEL</name>
              <description>Flash Latch Delay Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>FLASHBIAS</name>
              <description>Flash Bias Value</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FPPW</name>
              <description>Flash Pico Power Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RC115</name>
              <description>RC 115KHZ Calibration Value</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>RCFAST</name>
              <description>RCFAST Calibration Value</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PSOK</name>
              <description>Power Scaling OK Interrupt Status Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error Interrupt Status Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PSOK</name>
              <description>Power Scaling OK Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error Interrupt Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PSOK</name>
              <description>Power Scaling OK Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error Interrupt Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PSOK</name>
              <description>Power Scaling OK Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error Interrupt Mask</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IORET</name>
          <description>Input Output Retention Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RET</name>
              <description>Retention on I/O lines after waking up from the BACKUP mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PSOK</name>
              <description>Power Scaling OK Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error Interrupt Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCON</name>
          <description>Power Mode Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PS</name>
              <description>Power Scaling Configuration Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PSCREQ</name>
              <description>Power Scaling Change Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSCM</name>
              <description>Power Scaling Change Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKUP</name>
              <description>BACKUP Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RET</name>
              <description>RETENTION Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLEEP</name>
              <description>SLEEP mode Configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CK32S</name>
              <description>32Khz-1Khz Clock Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FASTWKUP</name>
              <description>Fast Wakeup</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PSOK</name>
              <description>Power Scaling OK Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNLOCK</name>
          <description>Unlock Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Unlock Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Unlock Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
