specters312/SVD_DUMP/Atmel/ATSAM4LC2A.svd
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Main VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Main VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCTRL32</name>
          <description>Oscillator 32 Control Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>OSC32EN</name>
              <description>32 KHz Oscillator Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINSEL</name>
              <description>Pins Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN32K</name>
              <description>32 KHz output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN1K</name>
              <description>1 KHz output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Oscillator Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SELCURR</name>
              <description>Current selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Oscillator Start-up Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC32IFAVERSION</name>
          <description>32 KHz Oscillator Version Register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant nubmer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKSR</name>
          <description>Power and Clocks Status Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Main VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RC1MRDY</name>
              <description>RC 1MHz Oscillator Ready</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC1MCR</name>
          <description>1MHz RC Clock Configuration Register</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <resetValue>0x00000F00</resetValue>
          <fields>
            <field>
              <name>CLKOE</name>
              <description>1MHz RC Osc Clock Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCD</name>
              <description>Flash Calibration Done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKCAL</name>
              <description>1MHz RC Osc Calibration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RC32KCR</name>
          <description>32 kHz RC Oscillator Control Register</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable as Generic clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCEN</name>
              <description>Temperature Compensation Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN32K</name>
              <description>Enable 32 KHz output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN1K</name>
              <description>Enable 1 kHz output</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REF</name>
              <description>Reference select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCD</name>
              <description>Flash calibration done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RC32KIFBVERSION</name>
          <description>32 kHz RC Oscillator Version Register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC32KTUNE</name>
          <description>32kHz RC Oscillator Tuning Register</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FINE</name>
              <description>Fine value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>COARSE</name>
              <description>Coarse Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UNLOCK</name>
          <description>Unlock Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Unlock Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Unlock Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <name>KEYSelect</name>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid Key to Unlock register</description>
                  <value>0xaa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>BSCIF Version Register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VREGCR</name>
          <description>Voltage Regulator Configuration Register</description>
          <addressOffset>0x044</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIS</name>
              <description>Voltage Regulator disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSG</name>
              <description>Spread Spectrum Generator Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSW</name>
              <description>Stop Switching</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSWEVT</name>
              <description>Stop Switching On Event Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFV</name>
              <description>Store Final Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VREGIFGVERSION</name>
          <description>VREGIFA Version Register</description>
          <addressOffset>0x3EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000110</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VREGLPCSR</name>
          <description>LP Mode Control and Status Register</description>
          <addressOffset>0x050</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>VREGNCSR</name>
          <description>Normal Mode Control and Status Register</description>
          <addressOffset>0x04C</addressOffset>
          <size>32</size>
        </register>
