specters312/SVD_DUMP/Atmel/ATSAM4LC2A.svd
        <register>
          <name>MAN</name>
          <description>Manchester Configuration Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x30011004</resetValue>
          <fields>
            <field>
              <name>TX_PL</name>
              <description>Transmitter Preamble Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>TX_PLSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The Transmitter Preamble pattern generation is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_PP</name>
              <description>Transmitter Preamble Pattern</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TX_PPSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>ALL_ONE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ALL_ZERO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>ZERO_ONE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>ONE_ZERO</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_MPOL</name>
              <description>Transmitter Manchester Polarity</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TX_MPOLSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_PL</name>
              <description>Receiver Preamble Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>RX_PLSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The receiver preamble pattern detection is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_PP</name>
              <description>Receiver Preamble Pattern detected</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RX_PPSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>ALL_ONE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>ALL_ZERO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>ZERO_ONE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>ONE_ZERO</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MPOL</name>
              <description>Receiver Manchester Polarity</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RX_MPOLSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRIFT</name>
              <description>Drift compensation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DRIFTSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The USART can not recover from an important clock drift</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The USART can recover from clock drift. The 16X clock mode must be enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <alternateGroup>SPI_MODE</alternateGroup>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Usart Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RS485</name>
                  <description>RS485</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE</name>
                  <description>Hardware Handshaking</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODEM</name>
                  <description>Modem</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISO7816_T0</name>
                  <description>IS07816 Protocol: T = 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISO7816_T1</name>
                  <description>IS07816 Protocol: T = 1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRDA</name>
                  <description>IrDA</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LIN_Master</name>
                  <description>LIN Master</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LIN_Slave</name>
                  <description>LIN Slave</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_Master</name>
                  <description>SPI Master</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_Slave</name>
                  <description>SPI Slave</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCLKS</name>
              <description>Clock Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>USCLKSSelect</name>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>MCK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_DIV</name>
                  <description>MCK / DIV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCK</name>
                  <description>SCK</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHRL</name>
              <description>Character Length.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CHRLSelect</name>
                <enumeratedValue>
                  <name>5</name>
                  <description>5 bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>6 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>7 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>SPI CLock Phase</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPHASelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Data is changed on the leading edge of SPCK and captured on the following edge of SPCK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Data is captured on the leading edge of SPCK and changed on the following edge of SPCK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAR</name>
              <description>Parity Type</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>PARSelect</name>
                <enumeratedValue>
                  <name>EVEN</name>
                  <description>Even parity</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODD</name>
                  <description>Odd parity</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPACE</name>
                  <description>Parity forced to 0 (Space)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MARK</name>
                  <description>Parity forced to 1 (Mark)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Parity</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>No Parity</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI</name>
                  <description>Multi-drop mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>Multi-drop mode</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBSTOP</name>
              <description>Number of Stop Bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>NBSTOPSelect</name>
                <enumeratedValue>
                  <name>1</name>
                  <description>1 stop bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_5</name>
                  <description>1.5 stop bits (Only valid if SYNC=0)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2 stop bits</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHMODE</name>
              <description>Channel Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CHMODESelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECHO</name>
                  <description>Automatic Echo. Receiver input is connected to the TXD pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCAL_LOOP</name>
                  <description>Local Loopback. Transmitter output is connected to the Receiver Input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REMOTE_LOOP</name>
                  <description>Remote Loopback. RXD pin is internally connected to the TXD pin</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL</name>
              <description>SPI Clock Polarity</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPOLSelect</name>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>The inactive state value of SPCK is logic level zero</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>The inactive state value of SPCK is logic level one</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE9</name>
              <description>9-bit Character Length</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MODE9Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>CHRL defines character length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>9-bit character length</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKO</name>
              <description>Clock Output Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CLKOSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The USART does not drive the SCK pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The USART drives the SCK pin if USCLKS does not select the external clock SCK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVER</name>
              <description>Oversampling Mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OVERSelect</name>
                <enumeratedValue>
                  <name>X16</name>
                  <description>16x Oversampling</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X8</name>
                  <description>8x Oversampling</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INACK</name>
              <description>Inhibit Non Acknowledge</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>INACKSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The NACK is generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The NACK is not generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSNACK</name>
              <description>Disable Successive NACK</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DSNACKSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>NACK is sent on the ISO line as soon as a parity error occurs in the received character (unless INACK is set)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Successive parity errors are counted up to the value specified in the MAX_ITERATION field. These parity errors generatea NACK on the ISO line. As soon as this value is reached, no additional NACK is sent on the ISO line. The flag ITERATION is asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVDATA</name>
              <description>Inverted data</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MAX_ITERATION</name>
              <description>Max interation</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FILTER</name>
              <description>Infrared Receive Line Filter</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FILTERSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>The USART does not filter the receive line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The USART filters the receive line using a three-sample filter (1/16-bit clock) (2 over 3 majority)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
